АлогистикТест2/src/Documents/алк_ОтгрузкаЩепы/алк_ОтгрузкаЩепы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ОтгрузкаЩепы</name>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетВременныхДеклараций</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрОтправитель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрПолучатель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКУчету_ТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременнаяДекларация</name>
    <type>
      <types>DocumentRef.алк_ВременныеТаможенныеДекларации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Теплоход</name>
    <type>
      <types>CatalogRef.алк_Теплоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ОтгрузкаЩепы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументОтгрузкаЩепы, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОтгрузкаЩепыЗапасы.Номенклатура,
		|	алк_ОтгрузкаЩепыЗапасы.Характеристика,
		|	алк_ОтгрузкаЩепыЗапасы.ОбъемТаможня,
		|	алк_ОтгрузкаЩепыЗапасы.ВесНетто,
		|	&Период,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ВременнаяДекларация КАК ВТД
		|ИЗ
		|	Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
		|ГДЕ
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ОтгрузкаЩепыЗапасы.Номенклатура,
		|	&Период,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаСмены,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Смена,
		|	1 КАК КоличествоПакетов,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка КАК Основание
		|ИЗ
		|	Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
		|ГДЕ
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОтгрузкаЩепы);
		Запрос.УстановитьПараметр("Период", ДокументОтгрузкаЩепы.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетВременныхДеклараций", МассивРезультатов[0].Выгрузить());
		
		
		// Нач мод [Пакушев И.С.] [19.03.2018] 
		// Обращение № [0000000000] [ТекстЗаявки]
		// Было
		// Стало  // изменен запрос
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПередачиСобственныеСерии", МассивРезультатов[1].Выгрузить());
		// Кон мод [Пакушев И.С.] [19.03.2018]

		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		// 
		// УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		// 
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Спецификация") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Спецификация", "Спецификация", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Спецификация"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Спецификация";
		КомандаПечати.Представление = НСтр("ru = 'Спецификация.'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
		КомандаПечати.Идентификатор = "ТН";
		КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 2;
		
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "Спецификация" Тогда
				
				Сформировать_Спецификация(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	Функция ПредствалениеИдентификатораТС(НомерТС)
		//Если 8 цифр, тогда возврат "Вагон №"
		//иначе вовзврат "Автомашина"
		
		ИдТС = "Автомашина:";
		
		Если СтрДлина(НомерТС) = 8 Тогда
			ИдТС = "Вагон №";
		
			Для к = 1 по 8 цикл
				Если СтрНайти("0123456789", Сред(НомерТС,к,1)) = 0 Тогда
					ИдТС = "Автомашина:";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Возврат ИдТС;
	КонецФункции
	
	
	// Процедура формирования Спецификация
	//
	Процедура Сформировать_Спецификация(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Номер,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка КАК Ссылка,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Грузоотправитель,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Грузополучатель,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Продавец,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Покупатель,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ОтгрузкаЩепыЗапасы.Ссылка.Заказ),
		|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.Грузоотправитель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.Грузополучатель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.Покупатель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.Продавец),
		|	алк_ОтгрузкаЩепыЗапасы.ОбъемТаможня КАК Объем,
		|	алк_ОтгрузкаЩепыЗапасы.ВесНетто КАК ВесНеттоП,
		|	алк_ОтгрузкаЩепыЗапасы.ВесНетто КАК ВесБруттоП,
		|	алк_ОтгрузкаЩепыЗапасы.Номенклатура,
		|	алк_ОтгрузкаЩепыЗапасы.Характеристика,
		|	алк_ОтгрузкаЩепыЗапасы.НомерСтроки,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ИдентификаторТС,
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Сертификат КАК Сертификат
		|ИЗ
		|	Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
		|ГДЕ
		|	алк_ОтгрузкаЩепыЗапасы.Ссылка = &ТекущийДокумент
		|ИТОГИ
		|	СУММА(Объем),
		|	СУММА(ВесНеттоП),
		|	СУММА(ВесБруттоП)
		|ПО
		|	Ссылка";
		
		Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Шапка.Следующий();
		
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ОтгрузкаЩепы.СпецификацияВнавалку");
		
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
		+ НомерДокумента
		+ " от "
		+ Формат(Шапка.ДатаДокумента, "ДЛФ=D");
		
		ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
		//ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление; //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Грузоотправитель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
		//ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление; //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Грузополучатель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		//ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
		ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление; //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Продавец);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		//ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление; //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Покупатель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
		//Автомашина
		//Вагон №
		
		ОбластьМакета.Параметры.ИдентификаторТС = ПредствалениеИдентификатораТС(СокрЛП(Шапка.ИдентификаторТС))+" "+ Шапка.ИдентификаторТС;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СортиментОтходы");	
		ОбластьМакета.Параметры.Номенклатура = "Щепа";
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаСтрокЗапасы = Шапка.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски1");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Пока ВыборкаСтрокЗапасы.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски1");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
			ОбластьМакета.Параметры.Сертификат = ВыборкаСтрокЗапасы.Сертификат.ПредставлениеНаПечать;
			
		
			// Нач мод [Пакушев И.С.] [24.04.2018] 
			// Обращение № [0000089575] [ТекстЗаявки]
			// Было
			// Стало
			
			Если ВыборкаСтрокЗапасы.Объем = 0 Тогда		
				ОбластьМакета.Параметры.Плотность = 0;
			Иначе
				ОбластьМакета.Параметры.Плотность = Окр(ВыборкаСтрокЗапасы.ВесНеттоП * 1000/ВыборкаСтрокЗапасы.Объем, 2); 	
			КонецЕсли;   
			
			// Кон мод [Пакушев И.С.] [24.04.2018]
			
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
	КонецПроцедуры //СформироватьАктПриемки()	
	
	
	Функция ПолучитьДанныеДляПечатиТН(ДокументСсылка) Экспорт
		
		
		ДанныеДляПечати = Новый Структура("КоличествоМест, Объем, ВесБрутто", 0, 0, 0); 	
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
		//|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
		//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
		//|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
		//|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
		//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
		//|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
		//|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто
		//|ИЗ
		//|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
		//|ГДЕ
		//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ДокументСсылка
		//|ИТОГИ
		//|	СУММА(КоличествоПакетов),
		//|	СУММА(Объем),
		//|	СУММА(ОбъемТаможня),
		//|	СУММА(КоличествоСостав),
		//|	СУММА(ВесНетто),
		//|	СУММА(ВесБрутто)
		//|ПО
		//|	ОБЩИЕ";
		//
		//Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//
		//ВыборкаОбщийИтог.Следующий();		// Общий итог
		//
		//// Вставить обработку выборки ВыборкаОбщийИтог
		//
		//ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
		//
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
		//КонецЦикла;
		//
		//ДанныеДляПечати.КоличествоМест = ВыборкаОбщийИтог.КоличествоПакетов;
		//ДанныеДляПечати.Объем          = ВыборкаОбщийИтог.Объем;
		//ДанныеДляПечати.ВесБрутто      = ВыборкаОбщийИтог.ВесБрутто;
		
		
		Возврат ДанныеДляПечати;
		
	КонецФункции

	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли
